GUdaoxi/demo_qspi/QSPI_QPI/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_adc.h
#define    ADC_HLTR_AWD_HT_Pos                                    (16U)
#define    ADC_HLTR_AWD_HT_Msk                                    (0xffffU << ADC_HLTR_AWD_HT_Pos)
#define    ADC_HLTR_AWD_HT                                        ADC_HLTR_AWD_HT_Msk

#define    ADC_HLTR_AWD_LT_Pos                                    (0U)
#define    ADC_HLTR_AWD_LT_Msk                                    (0xffffU << ADC_HLTR_AWD_LT_Pos)
#define    ADC_HLTR_AWD_LT                                        ADC_HLTR_AWD_LT_Msk

#define    ADC_AWDCR_CHEN_Pos                                     (0U)
#define    ADC_AWDCR_CHEN_Msk                                     (0xffffffffU << ADC_AWDCR_CHEN_Pos)
#define    ADC_AWDCR_CHEN                                         ADC_AWDCR_CHEN_Msk

#define    ADC_ACQ0_CR_CHSEL_Pos                                  (9U)
#define    ADC_ACQ0_CR_CHSEL_Msk                                  (0x1fU << ADC_ACQ0_CR_CHSEL_Pos)
#define    ADC_ACQ0_CR_CHSEL                                      ADC_ACQ0_CR_CHSEL_Msk

#define    ADC_ACQ0_CR_TRIGSEL_Pos                                (4U)
#define    ADC_ACQ0_CR_TRIGSEL_Msk                                (0x1fU << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    ADC_ACQ0_CR_TRIGSEL                                    ADC_ACQ0_CR_TRIGSEL_Msk

#define    ADC_ACQ0_CR_SMTS_Pos                                   (0U)
#define    ADC_ACQ0_CR_SMTS_Msk                                   (0xfU << ADC_ACQ0_CR_SMTS_Pos)
#define    ADC_ACQ0_CR_SMTS                                       ADC_ACQ0_CR_SMTS_Msk

#define    ADC_ACQ1_CR_CHSEL_Pos                                  (9U)
#define    ADC_ACQ1_CR_CHSEL_Msk                                  (0x1fU << ADC_ACQ1_CR_CHSEL_Pos)
#define    ADC_ACQ1_CR_CHSEL                                      ADC_ACQ1_CR_CHSEL_Msk

#define    ADC_ACQ1_CR_TRIGSEL_Pos                                (4U)
#define    ADC_ACQ1_CR_TRIGSEL_Msk                                (0x1fU << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    ADC_ACQ1_CR_TRIGSEL                                    ADC_ACQ1_CR_TRIGSEL_Msk

#define    ADC_ACQ1_CR_SMTS_Pos                                   (0U)
#define    ADC_ACQ1_CR_SMTS_Msk                                   (0xfU << ADC_ACQ1_CR_SMTS_Pos)
#define    ADC_ACQ1_CR_SMTS                                       ADC_ACQ1_CR_SMTS_Msk

#define    ADC_ACQ2_CR_CHSEL_Pos                                  (9U)
#define    ADC_ACQ2_CR_CHSEL_Msk                                  (0x1fU << ADC_ACQ2_CR_CHSEL_Pos)
#define    ADC_ACQ2_CR_CHSEL                                      ADC_ACQ2_CR_CHSEL_Msk

#define    ADC_ACQ2_CR_TRIGSEL_Pos                                (4U)
#define    ADC_ACQ2_CR_TRIGSEL_Msk                                (0x1fU << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    ADC_ACQ2_CR_TRIGSEL                                    ADC_ACQ2_CR_TRIGSEL_Msk

#define    ADC_ACQ2_CR_SMTS_Pos                                   (0U)
#define    ADC_ACQ2_CR_SMTS_Msk                                   (0xfU << ADC_ACQ2_CR_SMTS_Pos)
#define    ADC_ACQ2_CR_SMTS                                       ADC_ACQ2_CR_SMTS_Msk

#define    ADC_ACQ3_CR_CHSEL_Pos                                  (9U)
#define    ADC_ACQ3_CR_CHSEL_Msk                                  (0x1fU << ADC_ACQ3_CR_CHSEL_Pos)
#define    ADC_ACQ3_CR_CHSEL                                      ADC_ACQ3_CR_CHSEL_Msk

#define    ADC_ACQ3_CR_TRIGSEL_Pos                                (4U)
#define    ADC_ACQ3_CR_TRIGSEL_Msk                                (0x1fU << ADC_ACQ3_CR_TRIGSEL_Pos)
#define    ADC_ACQ3_CR_TRIGSEL                                    ADC_ACQ3_CR_TRIGSEL_Msk

#define    ADC_ACQ3_CR_SMTS_Pos                                   (0U)
#define    ADC_ACQ3_CR_SMTS_Msk                                   (0xfU << ADC_ACQ3_CR_SMTS_Pos)
#define    ADC_ACQ3_CR_SMTS                                       ADC_ACQ3_CR_SMTS_Msk

#define    ADC_SCANACQ_CR_SMTS_FAST_Pos                           (16U)
#define    ADC_SCANACQ_CR_SMTS_FAST_Msk                           (0xfU << ADC_SCANACQ_CR_SMTS_FAST_Pos)
#define    ADC_SCANACQ_CR_SMTS_FAST                               ADC_SCANACQ_CR_SMTS_FAST_Msk

#define    ADC_SCANACQ_CR_TRIGSEL_Pos                             (4U)
#define    ADC_SCANACQ_CR_TRIGSEL_Msk                             (0x1fU << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    ADC_SCANACQ_CR_TRIGSEL                                 ADC_SCANACQ_CR_TRIGSEL_Msk

#define    ADC_SCANACQ_CR_SMTS_SLOW_Pos                           (0U)
#define    ADC_SCANACQ_CR_SMTS_SLOW_Msk                           (0xfU << ADC_SCANACQ_CR_SMTS_SLOW_Pos)
#define    ADC_SCANACQ_CR_SMTS_SLOW                               ADC_SCANACQ_CR_SMTS_SLOW_Msk

#define    ADC_CHISR_IF_Pos                                       (0U)
#define    ADC_CHISR_IF_Msk                                       (0xffffffffU << ADC_CHISR_IF_Pos)
#define    ADC_CHISR_IF                                           ADC_CHISR_IF_Msk

#define    ADC_CHDMA_DR_CHID_Pos                                  (16U)
#define    ADC_CHDMA_DR_CHID_Msk                                  (0x1fU << ADC_CHDMA_DR_CHID_Pos)
#define    ADC_CHDMA_DR_CHID                                      ADC_CHDMA_DR_CHID_Msk

#define    ADC_CHDMA_DR_RESULT_Pos                                (0U)
#define    ADC_CHDMA_DR_RESULT_Msk                                (0xffffU << ADC_CHDMA_DR_RESULT_Pos)
#define    ADC_CHDMA_DR_RESULT                                    ADC_CHDMA_DR_RESULT_Msk

#define    ADC_CH0DR_RESULT_Pos                                   (0U)
#define    ADC_CH0DR_RESULT_Msk                                   (0xffffU << ADC_CH0DR_RESULT_Pos)
#define    ADC_CH0DR_RESULT                                       ADC_CH0DR_RESULT_Msk

#define    ADC_CH1DR_RESULT_Pos                                   (0U)
#define    ADC_CH1DR_RESULT_Msk                                   (0xffffU << ADC_CH1DR_RESULT_Pos)
#define    ADC_CH1DR_RESULT                                       ADC_CH1DR_RESULT_Msk

#define    ADC_CH2DR_RESULT_Pos                                   (0U)
#define    ADC_CH2DR_RESULT_Msk                                   (0xffffU << ADC_CH2DR_RESULT_Pos)
#define    ADC_CH2DR_RESULT                                       ADC_CH2DR_RESULT_Msk

#define    ADC_CH3DR_RESULT_Pos                                   (0U)
#define    ADC_CH3DR_RESULT_Msk                                   (0xffffU << ADC_CH3DR_RESULT_Pos)
#define    ADC_CH3DR_RESULT                                       ADC_CH3DR_RESULT_Msk

#define    ADC_CH4DR_RESULT_Pos                                   (0U)
#define    ADC_CH4DR_RESULT_Msk                                   (0xffffU << ADC_CH4DR_RESULT_Pos)
#define    ADC_CH4DR_RESULT                                       ADC_CH4DR_RESULT_Msk

