GUdaoxi/demo_qspi/QSPI_QPI/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_adc.h
#define    ADC_CH5DR_RESULT_Pos                                   (0U)
#define    ADC_CH5DR_RESULT_Msk                                   (0xffffU << ADC_CH5DR_RESULT_Pos)
#define    ADC_CH5DR_RESULT                                       ADC_CH5DR_RESULT_Msk

#define    ADC_CH6DR_RESULT_Pos                                   (0U)
#define    ADC_CH6DR_RESULT_Msk                                   (0xffffU << ADC_CH6DR_RESULT_Pos)
#define    ADC_CH6DR_RESULT                                       ADC_CH6DR_RESULT_Msk

#define    ADC_CH7DR_RESULT_Pos                                   (0U)
#define    ADC_CH7DR_RESULT_Msk                                   (0xffffU << ADC_CH7DR_RESULT_Pos)
#define    ADC_CH7DR_RESULT                                       ADC_CH7DR_RESULT_Msk

#define    ADC_CH8DR_RESULT_Pos                                   (0U)
#define    ADC_CH8DR_RESULT_Msk                                   (0xffffU << ADC_CH8DR_RESULT_Pos)
#define    ADC_CH8DR_RESULT                                       ADC_CH8DR_RESULT_Msk

#define    ADC_CH9DR_RESULT_Pos                                   (0U)
#define    ADC_CH9DR_RESULT_Msk                                   (0xffffU << ADC_CH9DR_RESULT_Pos)
#define    ADC_CH9DR_RESULT                                       ADC_CH9DR_RESULT_Msk

#define    ADC_CH10DR_RESULT_Pos                                  (0U)
#define    ADC_CH10DR_RESULT_Msk                                  (0xffffU << ADC_CH10DR_RESULT_Pos)
#define    ADC_CH10DR_RESULT                                      ADC_CH10DR_RESULT_Msk

#define    ADC_CH11DR_RESULT_Pos                                  (0U)
#define    ADC_CH11DR_RESULT_Msk                                  (0xffffU << ADC_CH11DR_RESULT_Pos)
#define    ADC_CH11DR_RESULT                                      ADC_CH11DR_RESULT_Msk

#define    ADC_CH12DR_RESULT_Pos                                  (0U)
#define    ADC_CH12DR_RESULT_Msk                                  (0xffffU << ADC_CH12DR_RESULT_Pos)
#define    ADC_CH12DR_RESULT                                      ADC_CH12DR_RESULT_Msk

#define    ADC_CH13DR_RESULT_Pos                                  (0U)
#define    ADC_CH13DR_RESULT_Msk                                  (0xffffU << ADC_CH13DR_RESULT_Pos)
#define    ADC_CH13DR_RESULT                                      ADC_CH13DR_RESULT_Msk

#define    ADC_CH14DR_RESULT_Pos                                  (0U)
#define    ADC_CH14DR_RESULT_Msk                                  (0xffffU << ADC_CH14DR_RESULT_Pos)
#define    ADC_CH14DR_RESULT                                      ADC_CH14DR_RESULT_Msk

#define    ADC_CH15DR_RESULT_Pos                                  (0U)
#define    ADC_CH15DR_RESULT_Msk                                  (0xffffU << ADC_CH15DR_RESULT_Pos)
#define    ADC_CH15DR_RESULT                                      ADC_CH15DR_RESULT_Msk

#define    ADC_CH16DR_RESULT_Pos                                  (0U)
#define    ADC_CH16DR_RESULT_Msk                                  (0xffffU << ADC_CH16DR_RESULT_Pos)
#define    ADC_CH16DR_RESULT                                      ADC_CH16DR_RESULT_Msk

#define    ADC_CH17DR_RESULT_Pos                                  (0U)
#define    ADC_CH17DR_RESULT_Msk                                  (0xffffU << ADC_CH17DR_RESULT_Pos)
#define    ADC_CH17DR_RESULT                                      ADC_CH17DR_RESULT_Msk

#define    ADC_CH18DR_RESULT_Pos                                  (0U)
#define    ADC_CH18DR_RESULT_Msk                                  (0xffffU << ADC_CH18DR_RESULT_Pos)
#define    ADC_CH18DR_RESULT                                      ADC_CH18DR_RESULT_Msk

#define    ADC_CH19DR_RESULT_Pos                                  (0U)
#define    ADC_CH19DR_RESULT_Msk                                  (0xffffU << ADC_CH19DR_RESULT_Pos)
#define    ADC_CH19DR_RESULT                                      ADC_CH19DR_RESULT_Msk

#define    ADC_CH20DR_RESULT_Pos                                  (0U)
#define    ADC_CH20DR_RESULT_Msk                                  (0xffffU << ADC_CH20DR_RESULT_Pos)
#define    ADC_CH20DR_RESULT                                      ADC_CH20DR_RESULT_Msk

#define    ADC_CH21DR_RESULT_Pos                                  (0U)
#define    ADC_CH21DR_RESULT_Msk                                  (0xffffU << ADC_CH21DR_RESULT_Pos)
#define    ADC_CH21DR_RESULT                                      ADC_CH21DR_RESULT_Msk

#define    ADC_CH22DR_RESULT_Pos                                  (0U)
#define    ADC_CH22DR_RESULT_Msk                                  (0xffffU << ADC_CH22DR_RESULT_Pos)
#define    ADC_CH22DR_RESULT                                      ADC_CH22DR_RESULT_Msk

#define    ADC_CH23DR_RESULT_Pos                                  (0U)
#define    ADC_CH23DR_RESULT_Msk                                  (0xffffU << ADC_CH23DR_RESULT_Pos)
#define    ADC_CH23DR_RESULT                                      ADC_CH23DR_RESULT_Msk

#define    ADC_CH24DR_RESULT_Pos                                  (0U)
#define    ADC_CH24DR_RESULT_Msk                                  (0xffffU << ADC_CH24DR_RESULT_Pos)
#define    ADC_CH24DR_RESULT                                      ADC_CH24DR_RESULT_Msk

#define    ADC_CH25DR_RESULT_Pos                                  (0U)
#define    ADC_CH25DR_RESULT_Msk                                  (0xffffU << ADC_CH25DR_RESULT_Pos)
#define    ADC_CH25DR_RESULT                                      ADC_CH25DR_RESULT_Msk

#define    ADC_CH26DR_RESULT_Pos                                  (0U)
#define    ADC_CH26DR_RESULT_Msk                                  (0xffffU << ADC_CH26DR_RESULT_Pos)
#define    ADC_CH26DR_RESULT                                      ADC_CH26DR_RESULT_Msk

#define    ADC_CH27DR_RESULT_Pos                                  (0U)
#define    ADC_CH27DR_RESULT_Msk                                  (0xffffU << ADC_CH27DR_RESULT_Pos)
#define    ADC_CH27DR_RESULT                                      ADC_CH27DR_RESULT_Msk

#define    ADC_CH29DR_RESULT_Pos                                  (0U)
#define    ADC_CH29DR_RESULT_Msk                                  (0xffffU << ADC_CH29DR_RESULT_Pos)
#define    ADC_CH29DR_RESULT                                      ADC_CH29DR_RESULT_Msk

#define    ADC_CH30DR_RESULT_Pos                                  (0U)
#define    ADC_CH30DR_RESULT_Msk                                  (0xffffU << ADC_CH30DR_RESULT_Pos)
#define    ADC_CH30DR_RESULT                                      ADC_CH30DR_RESULT_Msk

#define    ADC_CH31DR_RESULT_Pos                                  (0U)
#define    ADC_CH31DR_RESULT_Msk                                  (0xffffU << ADC_CH31DR_RESULT_Pos)
#define    ADC_CH31DR_RESULT                                      ADC_CH31DR_RESULT_Msk



