GUdaoxi/demo_qspi/QSPI_QPI/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_adc.h
#define    FL_ADC_ACQ0                                            (0x1U << 0U)
#define    FL_ADC_ACQ1                                            (0x1U << 1U)
#define    FL_ADC_ACQ2                                            (0x1U << 2U)
#define    FL_ADC_ACQ3                                            (0x1U << 3U)
#define    FL_ADC_SCAN_ACQ                                        (0x1U << 4U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH0                 (0x0U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH1                 (0x1U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH2                 (0x2U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH3                 (0x3U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH4                 (0x4U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH5                 (0x5U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH6                 (0x6U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH7                 (0x7U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH8                 (0x8U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH9                 (0x9U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH10                (0xaU << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH11                (0xbU << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH12                (0xcU << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH13                (0xdU << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH14                (0xeU << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH15                (0xfU << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH16                (0x10U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH17                (0x11U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH18                (0x12U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH19                (0x13U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH20                (0x14U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH21                (0x15U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH22                (0x16U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH23                (0x17U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_TS                  (0x18U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_AVREF               (0x19U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_DAC                 (0x1aU << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_TSICAP              (0x1bU << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_VREFP               (0x1dU << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_VREFN_FAST          (0x1eU << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_VREFN_SLOW          (0x1fU << 9U)

#define    FL_ADC_SCANACQ_EXTERNAL_CH0                            (0x1U << 0U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH1                            (0x1U << 1U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH2                            (0x1U << 2U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH3                            (0x1U << 3U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH4                            (0x1U << 4U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH5                            (0x1U << 5U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH6                            (0x1U << 6U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH7                            (0x1U << 7U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH8                            (0x1U << 8U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH9                            (0x1U << 9U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH10                           (0x1U << 10U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH11                           (0x1U << 11U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH12                           (0x1U << 12U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH13                           (0x1U << 13U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH14                           (0x1U << 14U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH15                           (0x1U << 15U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH16                           (0x1U << 16U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH17                           (0x1U << 17U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH18                           (0x1U << 18U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH19                           (0x1U << 19U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH20                           (0x1U << 20U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH21                           (0x1U << 21U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH22                           (0x1U << 22U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH23                           (0x1U << 23U)
#define    FL_ADC_SCANACQ_INTERNAL_TS                             (0x1U << 24U)
#define    FL_ADC_SCANACQ_INTERNAL_AVREF                          (0x1U << 25U)
#define    FL_ADC_SCANACQ_INTERNAL_DAC                            (0x1U << 26U)
#define    FL_ADC_SCANACQ_INTERNAL_TSICAP                         (0x1U << 27U)
#define    FL_ADC_SCANACQ_INTERNAL_VREFP                          (0x1U << 29U)
#define    FL_ADC_SCANACQ_INTERNAL_VREFN_FAST                     (0x1U << 30U)
#define    FL_ADC_SCANACQ_INTERNAL_VREFN_SLOW                     (0x1U << 31U)
#define    FL_ADC_ALL_CHANNEL                                     (0xffffffffU << 0U)
#define    FL_ADC_ACQ_TRGI_SOFE_TRGO                              (0x0U << 4U)
#define    FL_ADC_ACQ_TRGI_ATIM_TRGO                              (0x1U << 4U)
#define    FL_ADC_ACQ_TRGI_ATIM_TRGO2                             (0x2U << 4U)
#define    FL_ADC_ACQ_TRGI_BSTIM_TRGO                             (0x3U << 4U)
#define    FL_ADC_ACQ_TRGI_LPTIM_TRGO                             (0x4U << 4U)
#define    FL_ADC_ACQ_TRGI_RTC_TRGO                               (0x5U << 4U)
#define    FL_ADC_ACQ_TRGI_COMP1_TRGO                             (0x6U << 4U)
#define    FL_ADC_ACQ_TRGI_COMP2_TRGO                             (0x7U << 4U)
#define    FL_ADC_ACQ_TRGI_TAU00_TRGO                             (0x8U << 4U)
#define    FL_ADC_ACQ_TRGI_TAU01_TRGO                             (0x9U << 4U)
#define    FL_ADC_ACQ_TRGI_TAU02_TRGO                             (0xaU << 4U)
#define    FL_ADC_ACQ_TRGI_TAU03_TRGO                             (0xbU << 4U)
#define    FL_ADC_ACQ_TRGI_TAU04_TRGO                             (0xcU << 4U)
#define    FL_ADC_ACQ_TRGI_TAU05_TRGO                             (0xdU << 4U)
#define    FL_ADC_ACQ_TRGI_TAU06_TRGO                             (0xeU << 4U)
#define    FL_ADC_ACQ_TRGI_TAU07_TRGO                             (0xfU << 4U)
#define    FL_ADC_ACQ_TRGI_TAU10_TRGO                             (0x10U << 4U)
#define    FL_ADC_ACQ_TRGI_TAU11_TRGO                             (0x11U << 4U)
#define    FL_ADC_ACQ_TRGI_TAU12_TRGO                             (0x12U << 4U)
#define    FL_ADC_ACQ_TRGI_TAU13_TRGO                             (0x13U << 4U)
#define    FL_ADC_ACQ_TRGI_TAU14_TRGO                             (0x14U << 4U)
#define    FL_ADC_ACQ_TRGI_TAU15_TRGO                             (0x15U << 4U)
#define    FL_ADC_ACQ_TRGI_TAU16_TRGO                             (0x16U << 4U)
#define    FL_ADC_ACQ_TRGI_TAU17_TRGO                             (0x17U << 4U)
#define    FL_ADC_ACQ_SAMPLING_TIME_1_ADCCLK                      (0x0U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_2_ADCCLK                      (0x1U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_4_ADCCLK                      (0x2U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_8_ADCCLK                      (0x3U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_12_ADCCLK                     (0x4U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_16_ADCCLK                     (0x5U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_32_ADCCLK                     (0x6U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_64_ADCCLK                     (0x7U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_80_ADCCLK                     (0x8U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_96_ADCCLK                     (0x9U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_128_ADCCLK                    (0xaU << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_160_ADCCLK                    (0xbU << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_192_ADCCLK                    (0xcU << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_256_ADCCLK                    (0xdU << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_320_ADCCLK                    (0xeU << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_512_ADCCLK                    (0xfU << 0U)
#define    FL_ADC_EXTERNAL_CH0                                    (0x1U << 0U)
#define    FL_ADC_EXTERNAL_CH1                                    (0x1U << 1U)
#define    FL_ADC_EXTERNAL_CH2                                    (0x1U << 2U)
#define    FL_ADC_EXTERNAL_CH3                                    (0x1U << 3U)
#define    FL_ADC_EXTERNAL_CH4                                    (0x1U << 4U)
#define    FL_ADC_EXTERNAL_CH5                                    (0x1U << 5U)
#define    FL_ADC_EXTERNAL_CH6                                    (0x1U << 6U)
#define    FL_ADC_EXTERNAL_CH7                                    (0x1U << 7U)
#define    FL_ADC_EXTERNAL_CH8                                    (0x1U << 8U)
#define    FL_ADC_EXTERNAL_CH9                                    (0x1U << 9U)
#define    FL_ADC_EXTERNAL_CH10                                   (0x1U << 10U)
#define    FL_ADC_EXTERNAL_CH11                                   (0x1U << 11U)
#define    FL_ADC_EXTERNAL_CH12                                   (0x1U << 12U)
#define    FL_ADC_EXTERNAL_CH13                                   (0x1U << 13U)
#define    FL_ADC_EXTERNAL_CH14                                   (0x1U << 14U)
#define    FL_ADC_EXTERNAL_CH15                                   (0x1U << 15U)
#define    FL_ADC_EXTERNAL_CH16                                   (0x1U << 16U)
#define    FL_ADC_EXTERNAL_CH17                                   (0x1U << 17U)
#define    FL_ADC_EXTERNAL_CH18                                   (0x1U << 18U)
#define    FL_ADC_EXTERNAL_CH19                                   (0x1U << 19U)
#define    FL_ADC_EXTERNAL_CH20                                   (0x1U << 20U)
#define    FL_ADC_EXTERNAL_CH21                                   (0x1U << 21U)
#define    FL_ADC_EXTERNAL_CH22                                   (0x1U << 22U)
#define    FL_ADC_EXTERNAL_CH23                                   (0x1U << 23U)
#define    FL_ADC_INTERNAL_TS                                     (0x1U << 24U)
#define    FL_ADC_INTERNAL_AVREF                                  (0x1U << 25U)
#define    FL_ADC_INTERNAL_DAC                                    (0x1U << 26U)
#define    FL_ADC_INTERNAL_TSICAP                                 (0x1U << 27U)
#define    FL_ADC_INTERNAL_VREFP                                  (0x1U << 29U)
#define    FL_ADC_INTERNAL_VREFN_FAST                             (0x1U << 30U)
#define    FL_ADC_INTERNAL_VREFN_SLOW                             (0x1U << 31U)



#define    FL_ADC_BOOTSTRAP_Voltage_VDDA                          (0x0U << ADC_CFGR1_CTRL_BOOST_Pos)
#define    FL_ADC_BOOTSTRAP_Voltage_2P5V                          (0x1U << ADC_CFGR1_CTRL_BOOST_Pos)


#define    FL_ADC_SOC_EDGE_MODE_RISE                              (0x0U << ADC_CFGR1_SOCIF_CFG_Pos)
#define    FL_ADC_SOC_EDGE_MODE_FALL                              (0x1U << ADC_CFGR1_SOCIF_CFG_Pos)


